# Employee retention 
Predict when the employee is going to quit
1.  build a table with 3 columns, day, emplyee_headcount, company_id
2. What are the main factors that derive employee churn? Why?
3. add one more factor to explain employee churn.

In [8]:
import numpy as np
import pandas as pd
import datetime
from scipy.stats import ttest_ind
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
import matplotlib.pyplot as plt

%matplotlib inline

In [9]:
df = pd.read_csv('employee_retention_data.csv', parse_dates = True)
df.head()

,employee_id,company_id,dept,seniority,salary,join_date,quit_date
0,13021.0,7,customer_service,28,89000.0,2014-03-24,2015-10-30
1,825355.0,7,marketing,20,183000.0,2013-04-29,2014-04-04
2,927315.0,4,marketing,14,101000.0,2014-10-13,NaN
3,662910.0,7,customer_service,20,115000.0,2012-05-14,2013-06-07
4,256971.0,2,data_science,23,276000.0,2011-10-17,2014-08-22

In [13]:
df['join_date']= pd.DatetimeIndex(df['join_date'])
df['quit_date']= pd.DatetimeIndex(df['quit_date'])
df['work_time']= df['quit_date']- df['join_date']
df['work_time'].head()

0    585 days
1    340 days
2         NaT
3    389 days
4   1040 days
Name: work_time, dtype: timedelta64[ns]

In [18]:
#df1 = df.groupby(['company_id','join_date','quit_date'])['employee_id'].count()
df.loc[df['join_date']==df['quit_date'] ]

Empty DataFrame
Columns: [employee_id, company_id, dept, seniority, salary, join_date, quit_date, work_time]
Index: []

In [16]:
df.groupby(['company_id','join_date','quit_date'])['employee_id'].count()

company_id  join_date   quit_date
1           2011-01-24  2011-10-21    1
                        2011-12-30    2
                        2012-01-06    1
                        2012-02-03    1
                        2012-02-24    1
                        2012-04-13    1
                        2012-08-31    1
                        2012-11-09    1
                        2012-12-21    1
                        2013-02-08    1
                        2013-03-01    2
                        2013-03-08    1
                        2013-03-22    1
                        2013-04-05    1
                        2013-06-07    1
                        2013-07-05    1
                        2013-11-15    1
                        2014-01-03    1
                        2014-01-24    1
                        2014-05-09    1
                        2014-11-28    1
                        2014-12-19    1
                        2015-01-16    1
            2011-01-25  2011-11-11    1
                        2015-07-06    1
            2011-01-26  2012-01-06    1
                        2013-03-22    1
            2011-01-31  2011-11-22    1
                        2011-11-25    1
                        2012-01-06    1
                                     ..
10          2014-11-03  2015-11-20    1
            2014-11-10  2015-11-27    1
            2014-11-13  2015-10-02    1
            2014-11-17  2015-12-04    1
            2014-11-24  2015-11-13    1
            2015-01-06  2015-11-20    1
11          2011-02-22  2013-06-21    1
            2011-10-31  2012-12-07    1
            2011-12-27  2014-03-28    1
            2012-03-26  2014-08-08    1
            2012-04-11  2015-02-06    1
            2012-06-18  2013-06-07    1
            2013-01-15  2014-01-24    1
            2013-02-05  2014-02-21    1
            2013-02-25  2014-08-15    1
            2013-09-12  2014-07-18    1
            2014-02-10  2015-01-30    1
            2014-06-16  2015-05-08    1
12          2011-03-14  2012-02-24    1
            2011-05-16  2012-05-04    1
            2011-06-06  2012-05-18    1
            2011-06-20  2013-10-18    1
            2011-10-13  2013-07-12    1
            2012-03-12  2013-04-05    1
            2012-07-02  2013-05-10    1
            2012-11-12  2013-10-25    1
            2012-11-26  2014-09-19    1
            2013-03-11  2014-02-07    1
            2013-07-29  2015-05-08    1
            2014-05-19  2015-05-08    1
Name: employee_id, Length: 12696, dtype: int64